Repository: Stazz0/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/contributing.md.po
Languages: fi, hr, uk

source: [![Sponsor with GitHub](https://img.shields.io/github/sponsors/niccokunzmann?logo=github&label=GitHub%20Sponsors)](https://github.com/sponsors/niccokunzmann) [![Support on Open Collective](https://img.shields.io/opencollective/all/open-web-calendar?label=support%20on%20open%20collective)](https://opencollective.com/open-web-calendar/)
hr: [![Sponzoriraj putem GitHuba](https://img.shields.io/github/sponsors/niccokunzmann?logo=github&label=GitHub%20Sponsors)](https://github.com/sponsors/niccokunzmann) [![Podrška na Open Collective](https://img.shields.io/opencollective/all/open-web-calendar?label=support%20on%20open%20collective)](https://opencollective.com/open-web-calendar/)
uk: [![Спонсор з GitHub](https://img.shields.io/github/sponsors/niccokunzmann?logo=github&label=GitHub%20Sponsors)](https://github.com/sponsors/niccokunzmann) [![Підтримка на Open Collective](https://img.shields.io/opencollective/all/open-web-calendar?label=support%20on%20open%20collective)](https://opencollective.com/open-web-calendar/)

source: [Set up your development environment](../dev/)
hr: [Postavi svoje razvojno okruženje](../dev/)
uk: [Налаштуйте середовище розробки](../dev/)

source: Ways to Contribute
hr: Načini doprinošenja
uk: Способи зробити внесок

source: 🐛 Report Bugs
hr: 🐛 Prijavi greške
uk: 🐛 Повідомити про помилки

source: Found a bug? Please [create an issue](https://github.com/niccokunzmann/open-web-calendar/issues) with:
hr: Pronašao/la si grešku? [Prijavi problem](https://github.com/niccokunzmann/open-web-calendar/issues) sa sljedećim točkama:
uk: Знайшли помилку? Будь ласка, [створіть проблему](https://github.com/niccokunzmann/open-web-calendar/issues) за допомогою:

source: Clear description of the problem
hr: Jasan opis problema
uk: Чіткий опис проблеми

source: Steps to reproduce
hr: Koraci za reprodukciju
uk: Кроки для розмноження

source: Expected vs actual behavior
hr: Očekivano naspram stvarnog ponašanja
uk: Очікувана та фактична поведінка

source: 💡 Suggest Features
hr: 💡 Predloži funkcije
uk: 💡 Запропонувати функції

source: Have an idea? [Open an issue](https://github.com/niccokunzmann/open-web-calendar/issues) to discuss it!
hr: Imaš ideju? [Prijavi problem](https://github.com/niccokunzmann/open-web-calendar/issues) kako bi zajednica o tome raspravljala!
uk: Маєте ідею? [Відкрийте проблему](https://github.com/niccokunzmann/open-web-calendar/issues), щоб обговорити її!

source: 🔧 Code Contributions
hr: 🔧 Doprinosi programskom kodu
uk: 🔧 Внески коду

source: **Fork the repository**
hr: **Izradi vlastitu kopiju (fork) repozitorija**
uk: **Форк репозиторію**

source: **Create a feature branch**: `git checkout -b feature/your-feature-name`
hr: **Stvori granu funkcija**: `git checkout -b feature/your-feature-name`
uk: **Створити гілку feature**: `git checkout -b feature/назва-вашої-функції`

source: **Set up development environment**: See [development documentation](../dev/)
hr: **Postavi razvojno okruženje**: Pogledaj [dokumentaciju za razvoj](../dev/)
uk: **Налаштування середовища розробки**: Див. [документацію з розробки](../dev/)

source: **Make your changes**
hr: **Izradi promjene**
uk: **Внесіть зміни**

source: **Run tests**
hr: **Pokreni testove**
uk: **Виконайте тести**

source: **Submit a pull request**
hr: **Pošalji zahtjev za preuzimanje**
uk: **Надіслати запит на зняття**

source: 📚 Documentation
hr: 📚 Dokumentacija
uk: 📚 Документація

source: Help improve our documentation by:
hr: Pomogni poboljšati dokumentaciju na sljedeće načine:
uk: Допоможіть покращити нашу документацію, виконавши такі дії:

source: Fixing typos or unclear instructions
hr: Ispravi tipografske grešake ili nejasne upute
uk: Виправлення друкарських помилок або незрозумілих інструкцій

source: Adding examples
hr: Dodaj primjere
uk: Додавання прикладів

source: Get Help
hr: Traži pomoć
uk: Отримати допомогу

source: Questions? Check our [documentation](https://open-web-calendar.hosted.quelltext.eu) or join the [discussions](https://github.com/niccokunzmann/open-web-calendar/discussions).
hr: Imaš pitanja? Pogledaj našu [dokumentaciju](https://open-web-calendar.hosted.quelltext.eu) ili se pridruži [raspravama](https://github.com/niccokunzmann/open-web-calendar/discussions).
uk: Є питання? Перегляньте нашу [документацію](https://open-web-calendar.hosted.quelltext.eu) або приєднуйтесь до [обговорень](https://github.com/niccokunzmann/open-web-calendar/discussions).

source: You can improve the project yourself. Get started here.
fi: Voit parantaa projektia itse. Aloita tästä.

source: There are several ways in which you can help this project:
fi: On useita tapoja, joilla voit auttaa tätä projektia:

source: [Use it](https://open-web-calendar.hosted.quelltext.eu) and [report errors](https://github.com/niccokunzmann/open-web-calendar/issues)
fi: [Käytä sitä](https://open-web-calendar.hosted.quelltext.eu) ja [ilmoita vioista](https://github.com/niccokunzmann/open-web-calendar/issues)

source: Have a look at [open issues](https://github.com/niccokunzmann/open-web-calendar/issues) e.g. those especially to get started, labeled [good first issue](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22), leave a note and work on it.
fi: Katso [avoimet viat](https://github.com/niccokunzmann/open-web-calendar/issues) esim. erityisesti aloittamista varten merkityt [hyvä ensimmäinen vika](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22), jätä muistiinpano ja käsittele sitä.

source: Contribute ♥️
fi: Osallistu ♥️

source: [Fund development & maintenance - Polar](https://polar.sh/niccokunzmann/open-web-calendar)
fi: [Rahoita kehitystä ja ylläpitoa – Polar](https://polar.sh/niccokunzmann/open-web-calendar)

source: [Fund costs - Open Collective](https://opencollective.com/open-web-calendar/)
fi: [Rahoita kuluja – Open Collective](https://opencollective.com/open-web-calendar/)

source: [Fund sustainability - GitHub Sponsors](https://github.com/sponsors/niccokunzmann)
fi: [Rahoita kestävyyttä – GitHub-sponsorit](https://github.com/sponsors/niccokunzmann)

source: [Translate this project to your language](../dev/translate)
fi: [Käännä tämä projekti omalle kielellesi](../dev/translate)

source: If you customized a calendar, please consider [contributing it as a template](../templates) for others to use.
fi: Jos olet mukauttanut kalenteria, harkitse [sen jakamista mallina](../templates) muiden käytettäväksi.

source: If you are part of a company depending on the Open Web Calendar, please contact Nicco Kunzmann, the maintainer:
fi: Jos kuulut yritykseen, joka riippuu Open Web Calendarista, ota yhteyttä Nicco Kunzmanniin, ylläpitäjä:

source: You need features added.
fi: Tarvitset ominaisuuksia lisättäväksi.

source: You want to mitigate risks.
fi: Haluat lieventää riskejä.

source: You need add-ons or integrations.
fi: Tarvitset lisäosia tai integraatioita.

source: Support plans and maintenance contracts are available.
fi: Tukisuunnitelmat ja ylläpitosopimukset ovat saatavilla.
