Repository: Stazz0/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/index.md.po
Languages: fi, ru

source: Getting Started
fi: Aloittaminen

source: See the features or try the Open Web Calendar yourself!
fi: Katso ominaisuudet tai kokeile Open Web Calendaria itse!

source: A highly flexible calendar display for your website.
fi: Erittäin joustava kalenterinäyttö verkkosivustollesi.
ru: Гибкий дизайн календаря для вашего сайта.

source: Give a calendar your personal touch within minutes!
fi: Anna kalenterille persoonallinen kosketus muutamassa minuutissa!
ru: Придайте календарю индивидуальность за считанные минуты!

source: **[Try it out now!](https://open-web-calendar.hosted.quelltext.eu)**
fi: **[Kokeile heti!](https://open-web-calendar.hosted.quelltext.eu)**
ru: **[Попробуйте прямо сейчас!](https://open-web-calendar.hosted.quelltext.eu)**

source: [See Examples](templates.md)
fi: [Katso esimerkit](templates.md)

source: Features
fi: Ominaisuudet
ru: Возможности

source: Instant Event Syncing
fi: Välitön tapahtumien synkronointi
ru: Мгновенная синхронизация событий

source: Embed with an HTML snippet
fi: Upota HTML-koodinpätkällä
ru: Встраивание с помощью HTML-кода

source: Desktop and Mobile
fi: Työpöytä ja mobiili
ru: Для настольного компьютера и мобильных устройств

source: Multi-Language Support
fi: Monikielinen tuki
ru: Поддержка нескольких языков

source: Fixed and Automatic Timezone
fi: Kiinteä ja automaattinen aikavyöhyke
ru: Фиксированный и автоматический часовой пояс

source: Easy Editing
fi: Helppo muokkaaminen
ru: Простое редактирование

source: Designs To Choose
fi: Suunnittelut valittavissa
ru: Выбор дизайна

source: Multiple Calendar Sources
fi: Useita kalenterilähteitä
ru: Различные источники календарей

source: Style per Calendar, Category and more
fi: Tyyli kalenterin, luokan mukaan ja enemmän
ru: Стиль для каждого календаря, категории и других параметров

source: Custom CSS
fi: Mukautettu CSS
ru: Пользовательский CSS

source: Day, Week, Month, Agenda
fi: Päivä, viikko, kuukausi, esityslista
ru: День, неделя, месяц, повестка дня

source: Work Week
fi: Työviikko
ru: Рабочая неделя

source: Custom Date & Time Range
fi: Mukautettu päivämäärä- ja aikaväli
ru: Пользовательский диапазон дат и времени

source: Custom Title & Icon
fi: Muokattu otsikko ja kuvake
ru: Пользовательский заголовок и значок

source: Click on Event Location
fi: Napsauta Tapahtuman sijainti
ru: Клик по месту проведения события

source: Styled Event Descriptions
fi: Tyylilliset tapahtumakuvaukset
ru: Стилизованные описания событий

source: FOSS - No Vendor Lock-In
fi: FOSS – Ei toimittajan lukitusta
ru: Свободный проект — без привязки к поставщику

source: [Hosted](https://open-web-calendar.hosted.quelltext.eu) and [Self-Hosted](host/self.md)
fi: [Isännöity](https://open-web-calendar.hosted.quelltext.eu) ja [Itse isännöity](host/self.md)

source: Subscribe Link
fi: Tilaa-linkki
ru: Ссылка для подписки

source: Community and Paid Support
fi: Yhteisöllinen ja maksettu tuki
ru: Сообщество и платная поддержка

source: [Developer API](dev/api.md)
fi: [Kehittäjien sovellusliittymä](dev/api.md)

source: Customize Your Own Online Calendar Display
ru: Настройте ваш собственный Календарь

source: [See Examples](templates)
ru: [См. Примеры](templates)

source: [Hosted](https://open-web-calendar.hosted.quelltext.eu) and [Self-Hosted](host/self)
ru: [Сервис](https://open-web-calendar.hosted.quelltext.eu) и [развёрнутый у себя](host/self)

source: [Developer API](dev/api)
ru: [API для разработчиков](dev/api)
