Repository: Stazz0/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/host/configure.md.po
Languages: hr, ru

source: The configuration of all calendars is rooted in the [default_specification]. All those values can be changed through a copy of this file hosted on the web through the calendar parameter `specification_url`. Each parameter should be documented in [default_specification].
hr: Konfiguracija svih kalendara temelji se na [zadana_specifikacija]. Sve te vrijednosti mogu se promijeniti putem kopije ove datoteke koja se nalazi na webu putem parametra kalendara `specification_url`. Svaki parametar treba biti dokumentiran u [zadanoj_specifikaciji].
ru: Конфигурация всех календарей основана на [default_specification]. Все эти значения можно изменить, скопировав этот файл в веб-версии с помощью параметра календаря `specification_url`. Каждый параметр должен быть задокументирован в [default_specification].

source: To modify **all calendars** hosted on your instance, use the [OWC_SPECIFICATION] environment variable. Calendars still override some values for their configuration. Those which they do not override are affected by the default specification. Not all values are exposed to the configuration page to be changed. Those values can still be changed in the `specification_url` and the query parameters.
hr: Za mijenjanje **svih kalendara** koji se nalaze na tvojoj instanci, koristi varijablu okruženja [OWC_SPECIFICATION]. Kalendari i dalje nadjačavaju neke vrijednosti za svoju konfiguraciju. Na one koje ne nadjačavaju utječe zadana specifikacija. Na stranici za konfiguraciju se ne prikazuju sve vrijednosti za mijenjenje. Te se vrijednosti i dalje mogu mijenjati u `specification_url` i parametrima upita.
ru: Чтобы изменить **все календари**, размещённые на вашем экземпляре, используйте переменную среды [OWC_SPECIFICATION]. Календари по-прежнему переопределяют некоторые значения своей конфигурации. Те, которые они не переопределяют, попадают под действие спецификации по умолчанию. Не все значения доступны для изменения на странице конфигурации. Эти значения по-прежнему можно изменить в `specification_url` и параметрах запроса.

source: If you made changes, you are legally required to disclose them to visitors. Please adjust the link or contribute them back to the main project.
ru: Если вы внесли изменения, вы обязаны по закону раскрыть их посетителям. Пожалуйста, исправьте ссылку или верните их в основной проект.

source: If you want to redirect to contribute to your project.
ru: Если вы хотите перенаправить пользователя для участия в вашем проекте.

source: If you host this service yourself, you can use the default [privacy policy][privacy-policy].
hr: Ako hostiraš ovu uslugu, može koristiti zadani dokument za [pravila privatnosti][privacy-policy].
ru: Если вы размещаете этот сервис самостоятельно, вы можете использовать [политику конфиденциальности][privacy-policy] по умолчанию. Вы можете сослаться на политику конфиденциальности этого проекта.

source: If for some reason you decide to collect data i.e. in the HTTPS proxy or log IP-addresses, then you need to create your own privacy policy. You can link to the one of this project.
hr: Ako iz nekog razloga odlučiš prikupljati podatke, npr. putem HTTPS proxyja ili zapisivati IP adrese, tada moraš izraditi vlastitu politiku privatnosti. Možeš se povezati na politiku privatnosti ovog projekta.
ru: Если по какой-либо причине вы решили собирать данные, например, через HTTPS-прокси или регистрировать IP-адреса, вам необходимо создать собственную политику конфиденциальности.

source: More Values
ru: Дополнительные значения

source: There are loads more values that can be changed. Please refer to the [default_specification]. These values are all documented. Please use the [OWC_SPECIFICATION] environment variable to change them.
hr: Postoji još mnogo vrijednosti koje se mogu promijeniti. Pogledaj datoteku [zadana_specifikacija]. Sve su ove vrijednosti dokumentirane. Za mijenjanje vrijednosti koristi varijablu okruženja [OWC_SPECIFICATION].
ru: Существует множество других значений, которые можно изменить. См. [default_specification]. Все эти значения документированы. Для их изменения используйте переменную окружения [OWC_SPECIFICATION].

source: The clients divided by comma that are allowed to access the Open Web Calendar. You will see this text if you try to access the service and you are not allowed:
ru: Перечень клиентов, разделённых запятой, которым разрешён доступ к Open Web Calendar. Вы увидите этот текст, если попытаетесь получить доступ к сервису, но вам это не разрешено:

source: permit only the same computer: `ALLOWED_HOSTS=localhost`
ru: разрешить доступ только к одному компьютеру: `ALLOWED_HOSTS=localhost`

source: permit several hosts: `ALLOWED_HOSTS=192.168.0.1,192.168.2,api.myserver.com`
ru: разрешить доступ нескольким хостам: `ALLOWED_HOSTS=192.168.0.1,192.168.2,api.myserver.com`

source: permit everyone to access the server (default): `ALLOWED_HOSTS=` or `ALLOWED_HOSTS=*`
ru: разрешить всем доступ к серверу (по умолчанию): `ALLOWED_HOSTS=` или `ALLOWED_HOSTS=*`

source: This functionality is provided by [flask-allowed-hosts].
ru: Эта функциональность предоставляется [flask-allowed-hosts].

source: default `false`, values `true` or `false`, always `false` in the Docker container
hr: zadano `false`, vrijednosti `true` ili `false`, uvijek `false` u Docker kontejneru
ru: по умолчанию `false`, значения `true` или `false`, всегда `false` в контейнере Docker

source: default is a temporary directory (e.g. in `/tmp/`)
hr: zadana vrijednost je privremeni direktorij (npr. u `/tmp/`)
ru: по умолчанию — временный каталог (например, `/tmp/`)

source: The Open Web Calendar caches files needed to display calendars in this directory to speed up loading. If the directory does not exist, it will be created.
hr: Otvoreni web kalendar sprema datoteke potrebne za prikaz kalendara u ovom direktoriju radi ubrzavanja učitavanja. Ako direktorij ne postoji on će se kreiran stvoriti.
ru: Open Web Calendar кэширует файлы, необходимые для отображения календарей, в этом каталоге для ускорения загрузки. Если каталог не существует, он будет создан.

source: default `20` (MB)
hr: zadano `20` (MB)
ru: по умолчанию `20` (МБ)

source: Allow only small files of 4KB: `CACHE_FILE_SIZE=0.004`
hr: Dozvoli samo male datoteke od 4 KB: `CACHE_FILE_SIZE=0.004`
ru: Разрешить только небольшие файлы размером 4 КБ: `CACHE_FILE_SIZE=0.004`

source: Allow any size: `CACHE_FILE_SIZE="$CACHE_SIZE"`
hr: Dozvoli bilo koju veličinu: `CACHE_FILE_SIZE="$CACHE_SIZE"`
ru: Разрешить любой размер: `CACHE_FILE_SIZE="$CACHE_SIZE"`

source: Disable caching: `CACHE_FILE_SIZE=0`
hr: Deaktiviraj spremanje u predmemoriju: `CACHE_FILE_SIZE=0`
ru: Отключить кэширование: `CACHE_FILE_SIZE=0`

source: default `200` (MB)
hr: zadano `200` (MB)
ru: по умолчанию `200` (МБ)

source: This is the maximum cache size in megabytes. This size is limited to 200MB in order to mitigate the cache filling the file system or in case of `/tmp/` the RAM.
hr: Ovo je maksimalna veličina predmemorije u megabajtima. Ova veličina je ograničena na 200 MB kako bi se spriječilo da predmemorija ispuni datotečni sustav ili, u slučaju `/tmp/`, radnu memoriju (RAM).
ru: Это максимальный размер кэша в мегабайтах. Этот размер ограничен 200 МБ, чтобы предотвратить заполнение кэшем файловой системы или, в случае `/tmp/`, оперативной памяти.

source: Use 1 GB for caching: `CACHE_SIZE=1024`
hr: Koristi 1 GB za predmemoriranje: `CACHE_SIZE=1024`
ru: Использовать 1 ГБ для кэширования: `CACHE_SIZE=1024`

source: Unlimited cache: `CACHE_SIZE=unlimited`
hr: Neograničena predmemorija: `CACHE_SIZE=unlimited`
ru: Неограниченный кэш: `CACHE_SIZE=unlimited`

source: Disable caching: `CACHE_SIZE=0`
hr: Deaktiviraj spremanje u predmemoriju: `CACHE_SIZE=0`
ru: Отключить кэширование: `CACHE_SIZE=0`

source: default `600` (seconds)
hr: zadano `600` (sekundi)
ru: по умолчанию `600` (секунд)

source: Disable caching: `CACHE_REQUESTED_URLS_FOR_SECONDS=0`
hr: Deaktiviraj spremanje u predmemoriju: `CACHE_REQUESTED_URLS_FOR_SECONDS=0`
ru: Отключить кэширование: `CACHE_REQUESTED_URLS_FOR_SECONDS=0`

source: This is a comma separated list of encryption keys. These can be used to hide sensitive information of URLs.
hr: Ovo je popis ključeva za šifriranje odvojenih zarezima. Mogu se koristiti za skrivanje osjetljivih informacija URL-ova.
ru: Это список ключей шифрования, разделенных запятыми. Их можно использовать для сокрытия конфиденциальной информации URL-адресов.

source: Disable encryption (default): `OWC_ENCRYPTION_KEYS=`
hr: Deaktiviraj šifriranje (zadano): `OWC_ENCRYPTION_KEYS=`
ru: Отключить шифрование (по умолчанию): `OWC_ENCRYPTION_KEYS=`

source: Use one key: `OWC_ENCRYPTION_KEYS='Pj...48='`
hr: Koristi jedan ključ: `OWC_ENCRYPTION_KEYS='Pj...48='`
ru: Использовать один ключ: `OWC_ENCRYPTION_KEYS='Pj...48='`

source: Use multiple keys: `OWC_ENCRYPTION_KEYS='Pj...48=,cx...Fw='` If you use multiple keys, only the first one encrypts the data. The others are only used to decrypt the data.
hr: Koristi više ključeva: `OWC_ENCRYPTION_KEYS='Pj...48=,cx...Fw='` Ako koristiš više ključeva, samo prvi šifrira podatke. Ostali se koriste samo za dešifriranje podataka.
ru: Использовать несколько ключей: `OWC_ENCRYPTION_KEYS='Pj...48=,cx...Fw='` При использовании нескольких ключей только первый из них шифрует данные. Остальные используются только для расшифровки.

source: You can generate a new key by visiting your instance of the Open Web Calendar on the page [/new-key] or by running this command:
hr: Novi ključ možeš generirati na stranici [/new-key] tvoje instance za Otvoreni web kalendar ili pokretanjem ove naredbe:
ru: Вы можете сгенерировать новый ключ, посетив свой экземпляр Open Web Calendar на странице [/new-key] или выполнив следующую команду:

source: `OWC_SPECIFICATION` is an optional environment variable.
ru: `OWC_SPECIFICATION` — необязательная переменная окружения.

source: It can be a **path** to a file containing valid YAML or JSON.
ru: Это может быть **путь** к файлу, содержащему корректный YAML или JSON.

source: It can be a **string** containing valid YAML or JSON.
ru: Это может быть **строка**, содержащая корректный YAML или JSON.

source: Setting `OWC_SPECIFICATION` allows you to replace default values for all calendars.
ru: Настройка `OWC_SPECIFICATION` позволяет заменить значения по умолчанию для всех календарей.

source: In following example, the title for all calendars that do not set their own title will be changed.
ru: В следующем примере будут изменены заголовки всех календарей, у которых нет собственных заголовков.

source: [OWC_SPECIFICATION in the API](../../dev/api#owc_specification)
hr: [OWC_SPECIFICATION u API-ju](../../dev/api#owc_specification)
ru: [OWC_SPECIFICATION в API](../../dev/api#owc_specification)

source: PORT
ru: ПОРТ

source: WORKERS
ru: РАБОТНИКИ

source: The Open Web Calendar relies on proxy servers for these features:
hr: Otvoreni web kalendar se oslanja na proxy servere za ove funkcije:
ru: Открытый Web Calendar использует прокси-серверы для следующих функций:

source: **Access Control and Users** To restrict who can use the Open Web Calendar, you can use `nginx` or `apache` as a reverse proxy in front of it. YuNoHost is another self-hosting option to restrict access.
hr: **Kontrola pristupa i korisnici** Za oraničavanje korištenja kalendara „Otvoreni web kalendar”, možeš koristiti `ginx` ili `apache` kao obrnuti proxy ispred njega. YuNoHost je još jedna opcija samostalnog hostinga za ograničavanje pristupa.
ru: **Управление доступом и пользователи** Чтобы ограничить доступ к Open Web Calendar, вы можете использовать `nginx` или `apache` в качестве обратного прокси-сервера перед ним. YuNoHost — ещё один вариант самостоятельного размещения для ограничения доступа.

source: **HTTPS Encryption** This can be done by `nginx`, `apache` or `caddy`.
hr: **HTTPS šifriranje** To se može učiniti pomoću `nginx`, `apache` ili `caddy`.
ru: **HTTPS-шифрование**. Это можно реализовать с помощью `nginx`, `apache` или `caddy`.

source: **More Advanced Caching** Basic caching is handeled by the Open Web Calendar. For more advanced cache configuration, use a proxy server like `squid`. Have a look in the documentation below on how to make the Open Web Calendar access the web only through a proxy.
hr: **Naprednije predmemoriranje** Osnovno predmemoriranje obrađuje Otvoreni web kalendar. Za naprednije konfiguracije predmemorije, koristi proxy server poput `squid`. Pročitaj u dokumentaciji u nastavku kako omogućiti da Otvoreni web kalendar pristupi internetu isključivo putem proxyja.
ru: **Более продвинутое кэширование**. Базовое кэширование осуществляется Open Web Calendar. Для более продвинутой настройки кэша используйте прокси-сервер, например `squid`. Ознакомьтесь с документацией ниже, чтобы узнать, как настроить Open Web Calendar для доступа к веб-ресурсам только через прокси-сервер.

source: **Restricting Access to Calendars** By default, the Open Web Calendar does not restrict which calendars to show. Use the proxy server to filter the calendars. If you run the Open Web Calendar behind a firewall with other web services, setting up a proxy is necessary to protect from SSRF attacks.
hr: **Ograničavanje pristupa kalendarima** Prema zadanim postavkama, Otvoreni web kalendar ne ograničava koji će se kalendari prikazati. Za filtriranje kalendara koristi proxy server. Ako Otvoreni web kalendar pokrećeš iza vatrozida s drugim web uslugama, postavljanje proxyja je potrebno za zaštitu od SSRF napada.
ru: **Ограничение доступа к календарям**. По умолчанию Open Web Calendar не ограничивает отображаемые календари. Используйте прокси-сервер для фильтрации календарей. Если Open Web Calendar работает за брандмауэром с другими веб-сервисами, необходимо настроить прокси-сервер для защиты от SSRF-атак.

source: The Open Web Calendar can be used to access the local network behind a firewall, see [Issue 250](https://github.com/niccokunzmann/open-web-calendar/issues/250). This free access is intended to show calendars from everywhere. Since `requests` is used by the Open Web Calendar, it can use a proxy as described in the [`requests` documentation](https://requests.readthedocs.io/en/latest/user/advanced/#proxies). The proxy can then handle the filtering.
hr: Otvoreni web kalendar se može koristiti za pristup lokalnoj mreži iza vatrozida, pogledaj [Problem 250](https://github.com/niccokunzmann/open-web-calendar/issues/250). Ovaj besplatni pristup namijenjen je prikazu kalendara s bilo kojeg mjesta. Budući da Otvoreni web kalendar koristi `requests`, on može koristiti proxy kako je opisano u [`requests` dokumentaciji](https://requests.readthedocs.io/en/latest/user/advanced/#proxies). Tada proxy može obraditi filtriranje.
ru: Open Web Calendar можно использовать для доступа к локальной сети за брандмауэром, см. [Проблема 250](https://github.com/niccokunzmann/open-web-calendar/issues/250). Этот бесплатный доступ предназначен для отображения календарей из любой точки мира. Поскольку `requests` используется Open Web Calendar, он может использовать прокси-сервер, как описано в [документации `requests`](https://requests.readthedocs.io/en/latest/user/advanced/#proxies). Прокси-сервер затем может выполнять фильтрацию.

source: Squid as a Proxy Server
hr: Squid kao proxy server
ru: Squid как прокси-сервер

source: Operating System
hr: Operacijski sustav
ru: Операционная система

source: Configure a hosted instance.
hr: Konfiguriraj hostiranu instancu.

source: This is the maximum size of one file in the cache. When the cache is full, the least recently used file is removed.
hr: Ovo je maksimalna veličina jedne datoteke u predmemoriji. Kada se predmemorija napuni, uklanja se datoteka koja se najdulje nije koristila.

source: **Flask** has **[more environment variables](https://flask.palletsprojects.com/en/3.0.x/config/)** available to configure how the application serves content.
hr: **Flask** ima **[više varijabli okruženja](https://flask.palletsprojects.com/en/3.0.x/config/)** koje su dostupne za konfiguriranje načina na koji aplikacija poslužuje sadržaj.

source: **Requests** is used the get the `.ics` files. You can [configure a proxy](#ssrf-protection-with-a-proxy-server).
hr: **Zahtjevi** se koriste za dobivanje `.ics` datoteka. Možeš [konfigurirati proxy](#ssrf-protection-with-a-proxy-server).

source: The [Squid] Proxy and Cache is flexible and configurable. You can use it in front of the Open Web Calendar to configure access and customize caching.
hr: [Squid] proxy i predmemorija su fleksibilni i prilagodljivi. Možeš ih koristiti ispred Otvorenog web kalendara za konfiguriranje pristupa i prilagodbu predmemorije.

source: After you have installed the [Squid] Proxy, add this file into the `conf.d` directory. Squid will load it automatically then.
hr: Nakon što instaliraš [Squid] proxy, dodaj ovu datoteku u direktorij `conf.d`. Squid će je tada automatski učitati.

source: In Linux, create `/etc/squid/conf.d/open-web-calendar.conf`:
hr: Na Linuxu stvori `/etc/squid/conf.d/open-web-calendar.conf`:

source: The list above denies the Open Web Calendar access to all known local/internal networks. If you have your own local network (IPv4 or IPv6), add it to the list above to be sure.
hr: Gornji popis onemogućuje Otvorenom web kalendaru pristup svim poznatim lokalnim/internim mrežama. Ako imaš vlastitu lokalnu mrežu (IPv4 ili IPv6), dodaj je na gornji popis.

source: On Linux, you can install the file with this command:
hr: Na Linuxu možeš instalirati datoteku ovom naredbom:

source: Then, restart the squid proxy.
hr: Zatim ponovo pokreni squid proxy.

source: Set the environment variables to tell the Open Web Calendar to use the Squid proxy installed on `localhost`. Setting this variable changes depending on how you run the Open Web Calendar.
hr: Postavi varijable okruženja kako bi Otvoreni web kalendar znao da koristi Squid proxy instaliran na `localhost`. Postavljanje ove varijable se mijenja ovisno o tome kako se Otvoreni web kalendar pokreće.

source: If you use the [Python Setup][1], you can set the environment variables for the server like this:
hr: Ako koristiš [Python postavljanje][1], možeš postaviti varijable okruženja za server ovako:

source: Squid is avaiable for all major platforms. For the commands and paths of this tutorial, we assume you run Squid on Debain/Ubuntu. The commands might work on other systems, but that is not tested.
hr: Squid je dostupan za sve glavne platforme. Za naredbe i staze u ovom vodiču pretpostavljamo da pokrećeš Squid na Debain/Ubuntu. Naredbe bi mogle raditi na drugim sustavima, ali to nije testirano.
