Repository: Stazz0/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/dev/api.md.po
Languages: hr

source: `/calendar.json` - information about the calendar and the content as JSON
hr: `/calendar.json` – informacije o kalendaru i sadržaju u JSON formatu

source: `/calendar.events.json` - FLEXIBLE - get the events as JSON Please note that you CAN use this but you cannot be sure that the JSON schema remains the same. If you want that, add tests.
hr: `/calendar.events.json` – FLEKSIBILNO ” dohvati događaje u JSON formatu. Napomena: ovo se MOŽE koristiti, ali nije sigurno da će JSON shema ostati ista. Ako to želiš, dodaj testove.

source: All configuration parameters are described sufficiently in the [default_specification]. That is the reference. E.g. if you find the parameter `title` in the [default_specification], you have several options:
hr: Svi konfiguracijski parametri su dovoljno opisani u [zadanoj_specifikaciji]. To je referenca. Npr. ako pronađeš parametar `title` u [zadanoj_specifikaciji], imaš nekoliko mogućnosti:

source: You can change the calendar behavior and looks with parameters. If the same parameter is specified in different places, the earlier place listed below has the highest precedence. These are the places to specify parameters:
hr: Ponašanje i izgled kalendara se može promijeniti pomoću parametara. Ako je isti parametar naveden na različitim mjestima, ranije navedeno mjesto ima najveći prioritet. Ovo su mjesta za navođenje parametara:

source: All parameters to the calendar url are put into the specification. The query parameters have the highest precedence.
hr: Svi parametri URL-a kalendara stavljaju se u specifikaciju. Parametri upita imaju najveći prioritet.

source: If you specify this query parameter, the editor configuration is loaded from this url, too. Query parameters are still more important than what is written in this file. The source format can be YAML or JSON.
hr: Ako se ovaj parametar upita postavi, konfiguracija uređivača se također učitava s ovog URL-a. Parametri upita su i dalje važniji od onoga što je napisano u ovoj datoteci. Izvorni format može biti YAML ili JSON.

source: This file contains the default parameters. They must not be hard-coded in the source code. All parameters are listed and documented there so this file can be used for reference. Do not modify this file, instead use the `OWC_SPECIFICATION` environment variable.
hr: Ova datoteka sadrži zadane parametre. Ne smiju biti fiksno kodirani u izvornom kodu. Svi parametri su tamo navedeni i dokumentirani tako da se ova datoteka može koristiti kao referenca. Nemoj mijenjati ovu datoteku, umjesto toga koristi varijablu okruženja `OWC_SPECIFICATION`.

source: Add an implementation, depending on its use in the `app.py` or the templates of the JavaScript files. The specification is already available in all of them to use.
hr: Dodaj implementaciju ovisno o njenoj upotrebi u `app.py` ili predlošcima JavaScript datoteka. Specifikacija je već dostupna u svima njima za korištenje.

source: [app.py][app.py-81] compiles the specification from the given parameters in `get_specification()`. In the [template][dhtmlx-23] you can access the specification through the `specification` variable. The specification is available to JavaScript as the `specification` variable.
hr: [app.py][app.py-81] kompilira specifikaciju iz zadanih parametara u `get_specification()`. U [predlošku][dhtmlx-23] možeš pristupiti specifikaciji putem varijable `specification`. Specifikacija je dostupna JavaScriptu kao varijabla `specification`.

source: [JavaScript Customization](../javascript)
hr: [Prilagodba JavaScripta](../javascript)

source: The default specification is available before the calendar is built via JavaScript in the `configuration.default_specification` variable. There is a [getSpecification()] function which created the specification from the inputs. Generally, the `specification` variable should be used.
hr: Zadana specifikacija dostupna je prije nego što se kalendar izradi putem JavaScripta u varijabli `configuration.default_specification`. Postoji funkcija [getSpecification()] koja stvara specifikaciju iz ulaznih podataka. Općenito treba koristiti varijablu `specification`.
